anabolyc/esp32-esp8266-weather-station-color/src/main.cpp
/**The MIT License (MIT)

 Copyright (c) 2018 by ThingPulse Ltd., https://thingpulse.com

 Permission is hereby granted, free of charge, to any person obtaining a copy
 of this software and associated documentation files (the "Software"), to deal
 in the Software without restriction, including without limitation the rights
 to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 copies of the Software, and to permit persons to whom the Software is
 furnished to do so, subject to the following conditions:

 The above copyright notice and this permission notice shall be included in all
 copies or substantial portions of the Software.

 THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
 SOFTWARE.
 */

#include "settings.h"

#include <Arduino.h>
#include "time.h"
#include <SPI.h>
#ifdef ESP32
#include <WiFi.h>
#endif
#ifdef ESP8266
#include <ESP8266WiFi.h>
#endif

#include "SunMoonCalc.h"
#include <JsonListener.h>
#include <OpenWeatherMapCurrent.h>
#include <OpenWeatherMapForecast.h>
#include <Astronomy.h>
#include <MiniGrafx.h>
#include <Carousel.h>

#ifdef DISPLAY_ST7789
#include <ST7789_SPI.h>
#define Display ST7789_SPI
#endif
#ifdef DISPLAY_ILI9341
#include <ILI9341_SPI.h>
#define Display ILI9341_SPI
#endif
#include "ArialRounded.h"
#include "moonphases.h"
#include "weathericons.h"

#include "main.h"

#define MINI_BLACK 0
#define MINI_WHITE 1
#define MINI_YELLOW 2
#define MINI_BLUE 3

#define MAX_FORECASTS 12

// defines the colors usable in the paletted 16 color frame buffer
uint16_t palette[] = {ILI9341_BLACK,  // 0
                      ILI9341_WHITE,  // 1
                      ILI9341_YELLOW, // 2
                      0x7E3C};        // 3

// Limited to 4 colors due to memory constraints
int BITS_PER_PIXEL = 2; // 2^2 =  4 colors

#ifdef ESP8266
ADC_MODE(ADC_VCC);
#endif

Display tft = Display(TFT_CS, TFT_DC, TFT_RST);
MiniGrafx gfx = MiniGrafx(&tft, BITS_PER_PIXEL, palette);
Carousel carousel(&gfx, 0, 0, tft.width(), 100);
const int itemsOnCarousel = tft.width() > 300 ? 4 : 3;

#if defined(TOUCH_CS) && defined(TOUCH_IRQ)
#define TOUCH_ENABLED
#include <TouchControllerWS.h>
XPT2046_Touchscreen ts(TOUCH_CS, TOUCH_IRQ);
TouchControllerWS touchController(&ts);

void calibrationCallback(int16_t x, int16_t y);
CalibrationCallback calibration = &calibrationCallback;
#endif

OpenWeatherMapCurrentData currentWeather;
OpenWeatherMapForecastData forecasts[MAX_FORECASTS];

Astronomy::MoonData moonData;
// SunMoonCalc::Moon moonData;

int frameCount = 3;
FrameCallback frames[] = {drawForecast1, drawForecast2, drawForecast3};

// how many different screens do we have?
int screenCount = 5;
long lastDownloadUpdate = 0;
long lastScreenChange = 0;

uint16_t screen = 0;
long timerPress;
bool canBtnPress;

void connectWifi()
{
  if (WiFi.status() == WL_CONNECTED)
    return;

  // Manual Wifi
  Serial.printf("Connecting to WiFi %s/%s", WIFI_SSID.c_str(), WIFI_PASS.c_str());
  WiFi.disconnect();
  WiFi.mode(WIFI_STA);
  WiFi.hostname(CONFIG_WIFI_HOSTNAME);
  WiFi.begin(WIFI_SSID.c_str(), WIFI_PASS.c_str());
  int i = 0;
  while (WiFi.status() != WL_CONNECTED)
  {
    delay(500);
    if (i > 80)
      i = 0;
    drawProgress(i, "Connecting to WiFi '" + String(WIFI_SSID.c_str()) + "'");
    i += 10;
    Serial.print(".");
  }
  drawProgress(100, "Connected to WiFi '" + String(WIFI_SSID.c_str()) + "'");
  Serial.println("connected.");
  Serial.printf("Connected, IP address: %s/%s\n", WiFi.localIP().toString().c_str(), WiFi.subnetMask().toString().c_str()); // Get ip and subnet mask
  Serial.printf("Connected, MAC address: %s\n", WiFi.macAddress().c_str());                                                 // Get the local mac address
}

void initTime()
{
  time_t now;

  gfx.fillBuffer(MINI_BLACK);
  gfx.setFont(ArialRoundedMTBold_14);

  Serial.printf("Configuring time for timezone %s\n", TIMEZONE.c_str());
#ifdef ESP8266
  configTime(TIMEZONE.c_str(), NTP_SERVERS);
#endif
#ifdef ESP32
  configTime(GMT_OFFSET_SEC, DAYLIGHT_OFFSET_SEC, NTP_SERVERS);
#endif
  int i = 1;
  while ((now = time(nullptr)) < NTP_MIN_VALID_EPOCH)
  {
    drawProgress(i * 10, "Updating time...");
    Serial.print(".");
    delay(300);
    yield();
    i++;
  }
  drawProgress(100, "Time synchronized");
  Serial.println();

  printf("Local time: %s", asctime(localtime(&now))); // print formated local time, same as ctime(&now)
  printf("UTC time:   %s", asctime(gmtime(&now)));    // print formated GMT/UTC time
}

void setup()
{
  Serial.begin(SERIAL_BAUD);
  delay(500);
  Serial.println("Starting...");

  loadPropertiesFromSpiffs();

#ifdef TFT_LED
  // The LED pin needs to set HIGH
  // Use this pin to save energy
  // Turn on the background LED
  pinMode(TFT_LED, OUTPUT);
  digitalWrite(TFT_LED, HIGH); // HIGH to Turn on;
#endif

  gfx.init();
  gfx.fillBuffer(MINI_BLACK);
  gfx.setRotation(TFT_ROTATION);
  gfx.commit();

  Serial.printf("TFT: w = %d, h = %d\n", tft.width(), tft.height());

  connectWifi();

  #ifdef TOUCH_ENABLED
  Serial.println("Initializing touch screen...");
  ts.begin();
  #endif

  Serial.println("Mounting file system...");
  bool isFSMounted = SPIFFS.begin();
  if (!isFSMounted)
  {
    Serial.println("Formatting file system...");
    drawProgress(50, "Formatting file system");
    SPIFFS.format();
  }
  drawProgress(100, "Formatting done");

  #ifdef TOUCH_ENABLED
  boolean isCalibrationAvailable = touchController.loadCalibration();
  if (!isCalibrationAvailable)
  {
    Serial.println("Calibration not available");
    touchController.startCalibration(&calibration);
    while (!touchController.isCalibrationFinished())
    {
      gfx.fillBuffer(0);
      gfx.setColor(MINI_YELLOW);
      gfx.setTextAlignment(TEXT_ALIGN_CENTER);
      gfx.drawString(tft.width()/2, 160, "Please calibrate\ntouch screen by\ntouch point");
      touchController.continueCalibration();
      gfx.commit();
      yield();
    }
    touchController.saveCalibration();
  }
  #endif

