anabolyc/esp32-esp8266-weather-station-color/src/main.cpp
  carousel.setFrames(frames, frameCount);
  carousel.disableAllIndicators();

  initTime();

  // update the weather information
  updateData();
  lastDownloadUpdate = millis();

  lastScreenChange = millis();
  timerPress = millis();
  canBtnPress = true;
}

long lastDrew = 0;
bool btnClick;
// uint8_t MAX_TOUCHPOINTS = 10;
// TS_Point points[10];
// uint8_t currentTouchPoint = 0;

void loop()
{
  gfx.fillBuffer(MINI_BLACK);
  #ifdef TOUCH_ENABLED
  if (touchController.isTouched(0))
  {
    TS_Point p = touchController.getPoint();

    Serial.printf("Touch point detected at %d/%d.\n", p.x, p.y);

    if (p.y < 80)
    {
      IS_STYLE_12HR = !IS_STYLE_12HR;
    }
    else
    {
      screen = (screen + 1) % screenCount;
    }
  }
  #endif

  if (screen == 0)
  {
    drawTime();
    drawWifiQuality();
    int remainingTimeBudget = carousel.update();
    if (remainingTimeBudget > 0)
    {
      // You can do some work here
      // Don't do stuff if you are below your
      // time budget.
      delay(remainingTimeBudget);
    }
    drawCurrentWeather();
    drawAstronomy();
  }
  else if (screen == 1)
  {
    drawCurrentWeatherDetail();
  }
  else if (screen == 2)
  {
    drawForecastTable(0);
  }
  else if (screen == 3)
  {
    drawForecastTable(4);
  }
  else if (screen == 4)
  {
    drawAbout();
  }
  gfx.commit();

  // Check if we should update weather information
  if ((UPDATE_INTERVAL_SECS > 0) && (millis() - lastDownloadUpdate > 1000 * UPDATE_INTERVAL_SECS))
  {
    updateData();
    lastDownloadUpdate = millis();
  }

  // Check if screen should be changed automatically
  if ((SCREEN_CHANGE_SECS > 0) && (millis() - lastScreenChange > 1000 * SCREEN_CHANGE_SECS))
  {
    screen = (screen + 1) % screenCount;
    lastScreenChange = millis();
  }

  if ((SLEEP_INTERVAL_SECS > 0) && (millis() - timerPress >= SLEEP_INTERVAL_SECS * 1000))
  { // after 2 minutes go to sleep
    drawProgress(25, "Going to Sleep!");
    delay(1000);
    drawProgress(50, "Going to Sleep!");
    delay(1000);
    drawProgress(75, "Going to Sleep!");
    delay(1000);
    drawProgress(100, "Going to Sleep!");
// go to deepsleep for xx minutes or 0 = permanently
#ifdef ESP8266
    ESP.deepSleep(0, WAKE_RF_DEFAULT); // 0 delay = permanently to sleep
#endif
#ifdef ESP32
// not yet implemented for esp32
#endif
  }
}

// Update the internet based information and update screen
void updateData()
{
  time_t now = time(nullptr);

  gfx.fillBuffer(MINI_BLACK);
  gfx.setFont(ArialRoundedMTBold_14);

  drawProgress(50, "Updating conditions...");
  OpenWeatherMapCurrent *currentWeatherClient = new OpenWeatherMapCurrent();
  currentWeatherClient->setMetric(IS_METRIC);
  currentWeatherClient->setLanguage(OPEN_WEATHER_MAP_LANGUAGE);
  currentWeatherClient->updateCurrentById(&currentWeather, OPEN_WEATHER_MAP_API_KEY, OPEN_WEATHER_MAP_LOCATION_ID);
  delete currentWeatherClient;
  currentWeatherClient = nullptr;

  drawProgress(70, "Updating forecasts...");
  OpenWeatherMapForecast *forecastClient = new OpenWeatherMapForecast();
  forecastClient->setMetric(IS_METRIC);
  forecastClient->setLanguage(OPEN_WEATHER_MAP_LANGUAGE);
  uint8_t allowedHours[] = {12, 0};
  forecastClient->setAllowedHours(allowedHours, sizeof(allowedHours));
  forecastClient->updateForecastsById(forecasts, OPEN_WEATHER_MAP_API_KEY, OPEN_WEATHER_MAP_LOCATION_ID, MAX_FORECASTS);
  delete forecastClient;
  forecastClient = nullptr;

  drawProgress(80, "Updating astronomy...");
  Astronomy *astronomy = new Astronomy();
  moonData = astronomy->calculateMoonData(now);
  moonData.phase = astronomy->calculateMoonPhase(now);
  delete astronomy;
  astronomy = nullptr;
  // https://github.com/ThingPulse/esp8266-weather-station/issues/144 prevents using this
  //   // 'now' has to be UTC, lat/lng in degrees not raadians
  //   SunMoonCalc *smCalc = new SunMoonCalc(now - dstOffset, currentWeather.lat, currentWeather.lon);
  //   moonData = smCalc->calculateSunAndMoonData().moon;
  //   delete smCalc;
  //   smCalc = nullptr;
  Serial.printf("Free mem: %d\n", ESP.getFreeHeap());

  delay(1000);
}

// Progress bar helper
void drawProgress(uint8_t percentage, String text)
{
  gfx.fillBuffer(MINI_BLACK);
  gfx.drawPalettedBitmapFromPgm((tft.width() - ThingPulseLogo_Width) / 2, 5, ThingPulseLogo);
  gfx.setFont(ArialRoundedMTBold_14);
  gfx.setTextAlignment(TEXT_ALIGN_CENTER);
  gfx.setColor(MINI_WHITE);
  gfx.drawString(tft.width() / 2, 90, "https://thingpulse.com");
  gfx.setColor(MINI_YELLOW);

  gfx.drawString(tft.width() / 2, 146, text);
  gfx.setColor(MINI_WHITE);
  gfx.drawRect(10, 168, tft.width() - 2 * 10, 15);
  gfx.setColor(MINI_BLUE);
  gfx.fillRect(12, 170, (tft.width() - 2 * 12) * percentage / 100, 11);

  gfx.commit();
}

// draws the clock
void drawTime()
{
  char time_str[11];
  time_t now = time(nullptr);
  struct tm *timeinfo = localtime(&now);

  gfx.setTextAlignment(TEXT_ALIGN_CENTER);
  gfx.setFont(ArialRoundedMTBold_14);
  gfx.setColor(MINI_WHITE);
  String date = WDAY_NAMES[timeinfo->tm_wday] + " " + MONTH_NAMES[timeinfo->tm_mon] + " " + String(timeinfo->tm_mday) + " " + String(1900 + timeinfo->tm_year);
  gfx.drawString(tft.width() / 2, 6, date);

  gfx.setFont(ArialRoundedMTBold_36);

  if (IS_STYLE_12HR)
  {                                               // 12:00
    int hour = (timeinfo->tm_hour + 11) % 12 + 1; // take care of noon and midnight
    if (IS_STYLE_HHMM)
    {
      sprintf(time_str, "%2d:%02d\n", hour, timeinfo->tm_min); // hh:mm
    }
    else
    {
      sprintf(time_str, "%2d:%02d:%02d\n", hour, timeinfo->tm_min, timeinfo->tm_sec); // hh:mm:ss
    }
  }
  else
  { // 24:00
    if (IS_STYLE_HHMM)
    {
      sprintf(time_str, "%02d:%02d\n", timeinfo->tm_hour, timeinfo->tm_min); // hh:mm
    }
    else
    {
      sprintf(time_str, "%02d:%02d:%02d\n", timeinfo->tm_hour, timeinfo->tm_min, timeinfo->tm_sec); // hh:mm:ss
    }
  }

  gfx.drawString(tft.width() / 2, 20, time_str);

  gfx.setTextAlignment(TEXT_ALIGN_LEFT);
  gfx.setFont(ArialMT_Plain_10);
  gfx.setColor(MINI_BLUE);
  if (IS_STYLE_12HR)
  {
    sprintf(time_str, "\n%s", timeinfo->tm_hour >= 12 ? "PM" : "AM");
    gfx.drawString(195, 27, time_str);
  }
}

// draws current weather information
void drawCurrentWeather()
{
  gfx.setTransparentColor(MINI_BLACK);
  gfx.drawPalettedBitmapFromPgm(0, 55, getMeteoconIconFromProgmem(currentWeather.icon));

  // Weather Text
  gfx.setFont(ArialRoundedMTBold_14);
  gfx.setColor(MINI_BLUE);
  gfx.setTextAlignment(TEXT_ALIGN_RIGHT);
  gfx.drawString(tft.width() - 20, 65, DISPLAYED_LOCATION_NAME);

  gfx.setFont(ArialRoundedMTBold_36);
  gfx.setColor(MINI_WHITE);
  gfx.setTextAlignment(TEXT_ALIGN_RIGHT);

